beam_pattern.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-05 Sun 16:54 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Beam Pattern</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Beam Pattern</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1dcf64d">Beamforming</a></li>
<li><a href="#org4853ca9">Beam pattern</a>
<ul>
<li><a href="#org16de3e7">DFT beam</a></li>
<li><a href="#orgdc00516">Wide beam</a></li>
<li><a href="#orge30f352">PAS</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1dcf64d" class="outline-2">
<h2 id="org1dcf64d">Beamforming</h2>
<div class="outline-text-2" id="text-org1dcf64d">
<p>
Around the decades, <i>multi-input multi-output (MIMO)</i>, a.k.a. multiantenna transmission, has been the focus of the research relating to wireless communications, and attracted the interests and attentions from both academic circle and industrial area. By deliberately designing the complex-valued coefficients of each antenna elements, the transmitted power or its majority can be limited to a specified direction or area. The operation is termed <i>beamforming</i>, and accordingly the weights of all the antenna elements involved are termed a <i>beamforming vector</i> or a <i>beamformer</i>. In this case, the SINR and the power of the received signal at the receiver can be remarkably enhanced.
</p>
</div>
</div>
<div id="outline-container-org4853ca9" class="outline-2">
<h2 id="org4853ca9">Beam pattern</h2>
<div class="outline-text-2" id="text-org4853ca9">
<p>
Clearly, what matters most for beamforming is the beamformer design. Consequently, a variety of beamforming schemes have been proposed.
</p>
</div>
<div id="outline-container-org16de3e7" class="outline-3">
<h3 id="org16de3e7">DFT beam</h3>
<div class="outline-text-3" id="text-org16de3e7">
<p>
For a DFT beam, the beamformer is essentially a linear phase ramp, and the formed beam points to a specified direction, i.e.,
</p>
\begin{align*}
  \mathbf{w}(n, d, \theta) = \begin{bmatrix}
      1 & e^{j2\pi d \cos\theta} & e^{j4\pi d \cos\theta} & \dots e^{j2(n-1)\pi d \cos\theta}
      \end{bmatrix}^T,
\end{align*}
<p>
where
</p>
<ul class="org-ul">
<li>\(n\) is the number of antenna elements in the array.</li>
<li>\(d\) is the inter-antenna element distance (normalized to wave length).</li>
<li>\(\theta\) is the desired angle, which is defined from the plane where the array lies. Note that \(\theta = \pi/2\) means the boresight direction.</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">#!/usr/bin/env python

import numpy as np
import matplotlib.pyplot as plt
import sys

def gen_dft_beam(n: int, d: float, theta: float) -&gt; np.ndarray:
    '''
    Generate a linear phase ramp, which corresponds with a DFT beam.
    '''
    return np.exp(1j * 2.0 * np.pi * d * np.cos(theta) * np.arange(n)) / np.sqrt(n)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc00516" class="outline-3">
<h3 id="orgdc00516">Wide beam</h3>
<div class="outline-text-3" id="text-orgdc00516">
<p>
For DFT beams, the beamwidth depends on the aperture size of an antenna array. Given an antenna array, however, wide beam is sometimes expected for wider coverage. An example beamformer can be generated by following script.
</p>
<div class="org-src-container">
<pre class="src src-python">#!/usr/bin/env python

import numpy as np
import matplotlib.pyplot as plt
import sys

def gen_wide_beam(n: int, theta: float, x: int) -&gt; np.ndarray:
    '''
    Generate a wide beam, which is `x' times wider than a DFT beam.
    '''
    grp_sz = int(n / x)
    phi = np.array([(2 * g + 1) / grp_sz * np.pi for g in np.arange(x / 2)])
    w_prime = np.zeros(int(n / 2), dtype=complex)
    idx_range = np.zeros(grp_sz, dtype=int)
    for g in np.arange(x / 2, dtype=int):
        idx_range = grp_sz * g + np.arange(grp_sz)
        w_prime[idx_range] = np.exp(-1j * phi[g] * idx_range)
    w_prime = np.concatenate((w_prime, w_prime[::-1]))
    w = np.zeros(n, dtype=complex)
    for g in np.arange(x):
        idx_range = grp_sz * g + np.arange(grp_sz)
        w[idx_range] = w_prime[idx_range] * np.exp(1j * np.pi * (idx_range - (n - 1) / 2) * np.cos(theta))
    return w / np.sqrt(n)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge30f352" class="outline-3">
<h3 id="orge30f352">PAS</h3>
<div class="outline-text-3" id="text-orge30f352">
<p>
<i>Power angle spectrum (PAS)</i> is usually used to depict the beam pattern. It is essentially a relationship between angles and beamforming gains. Following scripts can plot PAS curves for various beam patterns.
</p>
<div class="org-src-container">
<pre class="src src-python">#!/usr/bin/env python

import numpy as np
import matplotlib.pyplot as plt
import sys

def calc_gain(d: float, w: np.ndarray, theta: float) -&gt; float:
    '''
    Calculate the beamforming gain of a given precoder (w) in the specified direction (of angle theta).
    '''
    g = np.dot(w.conj(), gen_dft_beam(len(w), d, theta))
    return 20 * np.log10(np.abs(g))

def gen_pas(d: float, w: np.ndarray):
    '''
    Generate a power angle spectrum (PAS) corresponding to the given precoder (w).
    '''
    angle = np.linspace(0, np.pi, 181)
    gain = np.array([calc_gain(d, w, theta) for theta in angle])
    return angle, gain

def plot_pas(angle: np.ndarray, gain: np.ndarray, lab: str):
    '''
    Plot the PAS with the given values.
    '''
    plt.rcParams['font.size'] = 12
    plt.plot(angle, gain, label=lab, linewidth=3)
    plt.title('Power angle spectrum (PAS)')
    plt.xlabel('$\\theta$')
    plt.ylabel('Beamforming gain (dB)')
    plt.xlim([angle.min(), angle.max()])
    plt.ylim(top=0)
    plt.grid(True)
    plt.legend()
    plt.tight_layout()
    plt.show()
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
